{
  "add_token_id": 32101,
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "bos_token_id": 1,
  "classifier_dropout": 0.0,
  "d_ff": 3072,
  "d_kv": 64,
  "d_model": 768,
  "decoder_start_token_id": 0,
  "del_token_id": 32102,
  "dense_act_fn": "relu",
  "dropout_rate": 0.1,
  "end_token_id": 32104,
  "eos_token_id": 2,
  "feed_forward_proj": "relu",
  "gradient_checkpointing": false,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": false,
  "keep_token_id": 32100,
  "label2id": {
    "LABEL_0": 0
  },
  "lang_id": {
    "<c>": 32213,
    "<c_plus_plus>": 32215,
    "<c_sharp>": 32214,
    "<en>": 32206,
    "<go>": 32212,
    "<java>": 32208,
    "<javascript>": 32209,
    "<php>": 32211,
    "<python>": 32207,
    "<ruby>": 32210
  },
  "lang_tokens": [
    "<en>",
    "<python>",
    "<java>",
    "<javascript>",
    "<ruby>",
    "<php>",
    "<go>",
    "<c>",
    "<c_sharp>",
    "<c_plus_plus>"
  ],
  "layer_norm_epsilon": 1e-06,
  "mask_token_id": 4,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 12,
  "num_heads": 12,
  "num_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "start_token_id": 32103,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 2.0,
      "max_length": 200,
      "min_length": 30,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "summarize: "
    },
    "translation_en_to_de": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to German: "
    },
    "translation_en_to_fr": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to French: "
    },
    "translation_en_to_ro": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to Romanian: "
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "use_cache": true,
  "vocab_size": 32216
}
